I tried to debug it further, and what I tried is:
* to change cycle type (`for_each` with sets, maps, `count`...)
* to move the cycle progressively into outer layers (from the resource to the module, to the invoking module) 
* to remove any and all cycling and explicitly call only once every involved resource (as plain as calling the resource without even variables)
* I re-validated all KMS instances and key IDs

I still get **random mixed responses** on subsequent plan executions: some times there's no change, some others Terraform tells me that the resource has been deleted outside Terraform and prompts me to create the missing resource.

```hcl
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.kms_cos.ibm_kms_key.root_key has been deleted
  - resource "ibm_kms_key" "root_key" {
      - crn                     = "crn:v1:bluemix:public:kms:ca-tor:a/ID1:ID2:key:ID3" -> null
      - endpoint_type           = "public" -> null
      - force_delete            = false -> null
      - id                      = "crn:v1:bluemix:public:kms:ca-tor:a/ID1:ID2:key:ID3" -> null
      - instance_crn            = "crn:v1:bluemix:public:kms:ca-tor:a/ID1:ID2::" -> null
      - instance_id             = "ID2" -> null
      - key_id                  = "ID3" -> null
      - key_name                = "root_key" -> null
      - key_ring_id             = "default" -> null
      - resource_controller_url = "https://cloud.ibm.com/services/kms/crn%3Av1%3Abluemix%3Apublic%3Akms%3Aca-tor%3Aa%2FID1%3AID2%3A%3A" -> null
      - resource_crn            = "crn:v1:bluemix:public:kms:ca-tor:a/ID1:ID2:key:ID3" -> null
      - resource_name           = "root_key" -> null
      - resource_status         = "1" -> null
      - standard_key            = false -> null
      - type                    = "kms" -> null

      - timeouts {}
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.kms_cos.ibm_kms_key.root_key will be created
  + resource "ibm_kms_key" "root_key" {
      + crn                     = (known after apply)
      + endpoint_type           = (known after apply)
      + force_delete            = false
      + id                      = (known after apply)
      + instance_crn            = (known after apply)
      + instance_id             = "ID2"
      + key_id                  = (known after apply)
      + key_name                = "root_key"
      + key_ring_id             = "default"
      + payload                 = (sensitive)
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + standard_key            = false
      + type                    = (known after apply)

      + policies {
          + dual_auth_delete {
              + created_by       = (known after apply)
              + creation_date    = (known after apply)
              + crn              = (known after apply)
              + enabled          = (known after apply)
              + id               = (known after apply)
              + last_update_date = (known after apply)
              + updated_by       = (known after apply)
            }

          + rotation {
              + created_by       = (known after apply)
              + creation_date    = (known after apply)
              + crn              = (known after apply)
              + id               = (known after apply)
              + interval_month   = (known after apply)
              + last_update_date = (known after apply)
              + updated_by       = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

